# coding: utf-8
require "date"
require "bigdecimal"

module JpNationalTax #:nodoc:
  module IncomeTax #:nodoc:
    #
    # https://www.nta.go.jp/publication/pamph/gensen/nencho2025/pdf/204.pdf
    #
    module Nenmatsu2027

      module_function

      def effective_date
        Date.parse("2027-12-01")
      end

      # 電子計算機等による年末調整
      #
      def 年調給与額(給与の総額)
        case 給与の総額
        when 1_900_000 .. 6_599_999
          階差 = 4_000
          同一階差の最小値 = 1_900_000
          給与の総額 - ((給与の総額 - 同一階差の最小値) % 階差)
        else
          給与の総額
        end
      end

      # 電子計算機等による年末調整
      #
      def 給与所得控除後の給与等の金額(年調給与額)
        case 年調給与額
        when 0 .. 650_999
          0
        when 651_000 .. 1_899_999
          年調給与額 - 650_000
        when  1_900_000 .. 3_599_999
          (年調給与額 * BigDecimal('0.7') + 80_000).floor
        when  3_600_000 .. 6_599_999
          (年調給与額 * BigDecimal('0.8') - 440_000).floor
        when  6_600_000 .. 8_499_999
          (年調給与額 * BigDecimal('0.9') - 1_100_000).floor
        when  8_500_000 .. 20_000_000
          年調給与額 - 1_950_000
        else
          STDERR.puts '年末調整の対象となりません'
          年調給与額 - 1_950_000
        end
      end

      # https://www.nta.go.jp/taxes/shiraberu/taxanswer/shotoku/1199.htm
      #
      def 基礎控除額(所得金額)
        case 所得金額
        when 0 .. 1_320_000
          950_000
        when 1_320_001 .. 23_500_000
          580_000
        when 23_500_001 .. 24_000_000
          480_000
        when 24_000_001 .. 24_500_000
          320_000
        when 24_500_001 .. 25_000_000
          160_000
        else
          0
        end
      end

      def 扶養控除の額(生年月日, 申告年, 所得金額 = 0, 同居: nil)
        return 0 if 生年月日.nil?

        基準日 = Date.new(申告年, 12, 31)
        if 生年月日 > 基準日.prev_year(16)
          0
        elsif 生年月日 <= 基準日.prev_year(70)
          return 0 if 所得金額 > 580_000
          同居 ? 580_000 : 480_000 # 老人扶養親族
        elsif 生年月日 <= 基準日.prev_year(19) and 生年月日 > 基準日.prev_year(23)
          特定親族特別控除額(所得金額)
        else
          所得金額 > 580_000 ? 0 : 380_000
        end
      end

      def 配偶者特別控除の金額(所得金額, 配偶者の所得金額, 配偶者の生年月日: nil, 申告年: nil)
        return 0 if 所得金額 > 10_000_000
        return 0 if 配偶者の所得金額 > 1_330_000

        老人控除対象 = if 申告年 and 配偶者の生年月日
                         基準日 = Date.new(申告年, 12, 31)
                         配偶者の生年月日 <= 基準日.prev_year(70)
                       else
                         false
                       end
        if 所得金額 <= 9_000_000
          case 配偶者の所得金額
          when 0 .. 580_000 # 配偶者控除
            老人控除対象 ? 480_000 : 380_000
          when 580_001 .. 950_000
            380_000
          when 950_001 .. 1_000_000
            360_000
          when 1_000_001 .. 1_050_000
            310_000
          when 1_050_001 .. 1_100_000
            260_000
          when 1_100_001 .. 1_150_000
            210_000
          when 1_150_001 .. 1_200_000
            160_000
          when 1_200_001 .. 1_250_000
            110_000
          when 1_250_001 .. 1_300_000
            60_000
          else
            30_000
          end
        elsif 所得金額 <= 9_500_000
          case 配偶者の所得金額
          when 0 .. 580_000
            老人控除対象 ? 320_000 : 260_000
          when 580_001 .. 950_000
            260_000
          when 950_001 .. 1_000_000
            240_000
          when 1_000_001 .. 1_050_000
            210_000
          when 1_050_001 .. 1_100_000
            180_000
          when 1_100_001 .. 1_150_000
            140_000
          when 1_150_001 .. 1_200_000
            110_000
          when 1_200_001 .. 1_250_000
            80_000
          when 1_250_001 .. 1_300_000
            40_000
          else
            20_000
          end
        else
          case 配偶者の所得金額
          when 0 .. 580_000
            老人控除対象 ? 160_000 : 130_000
          when 580_001 .. 950_000
            130_000
          when 950_001 .. 1_000_000
            120_000
          when 1_000_001 .. 1_050_000
            110_000
          when 1_050_001 .. 1_100_000
            90_000
          when 1_100_001 .. 1_150_000
            70_000
          when 1_150_001 .. 1_200_000
            60_000
          when 1_200_001 .. 1_250_000
            40_000
          when 1_250_001 .. 1_300_000
            20_000
          else
            10_000
          end
        end
      end

      def 特定親族特別控除額(所得金額)
        return 630_000 if 所得金額.nil? # 特定扶養親族

        case 所得金額
        when 0 .. 580_000
          630_000 # 特定扶養親族
        when 580_001 .. 850_000
          630_000
        when 850_001 .. 900_000
          610_000
        when 900_001 .. 950_000
          510_000
        when 950_001 .. 1_000_000
          410_000
        when 1_000_001 .. 1_050_000
          310_000
        when 1_050_001 .. 1_100_000
          210_000
        when 1_100_001 .. 1_150_000
          110_000
        when 1_150_001 .. 1_200_000
          60_000
        when 1_200_001 .. 1_230_000
          30_000
        else
          0
        end
      end

      # 電子計算機等による年末調整
      #
      def 算出所得税額(課税給与所得金額)
        tax = case 課税給与所得金額
              when 0 .. 1_950_000
                課税給与所得金額 * 0.05
              when 1_950_001 .. 3_300_000
                課税給与所得金額 * 0.1 - 97_500
              when 3_300_001 .. 6_950_000
                課税給与所得金額 * 0.2 - 427_500
              when 6_950_001 .. 9_000_000
                課税給与所得金額 * 0.23 - 636_000
              when 9_000_001 .. 18_000_000
                課税給与所得金額 * 0.33 - 1_536_000
              when 18_000_001 .. 18_050_000
                課税給与所得金額 * 0.4 - 2_796_000
              else
                raise '年末調整の対象となりません'
              end
        (tax / 1000).floor * 1000
      end

      # 電子計算機等による年末調整
      #
      def 年調年税額(年調所得税額)
        (年調所得税額 * BigDecimal('1.021') / 100).floor * 100
      end

    end
  end
end
